susanw1/zscript/receivers/generic-c++/zll/arm/implementations/src/main/c++/stm32/AlternateFunction/STM32L4Rx.h
/*
 * This file is automatically generated by afTable.py from the xml descriptions provided as part of the STM32Cube IDE
 * Timestamp: 2022-12-19T23:52:17.302226
 */

#ifndef LOWLEVEL_INCLUDE_DEVICE_ALTERNATE_FUNCTION
#define LOWLEVEL_INCLUDE_DEVICE_ALTERNATE_FUNCTION

#define CAN1_RX_PA11_ PA11,GPIO_AF9
#define CAN1_RX_PB8_ PB8,GPIO_AF9
#define CAN1_RX_PD0_ PD0,GPIO_AF9
#define CAN1_RX_PI9_ PI9,GPIO_AF9
#define _CAN1_RX_PA11_ 1
#define _CAN1_RX_PB8_ 1
#define _CAN1_RX_PD0_ 1
#define _CAN1_RX_PI9_ 1

#define CAN1_TX_PA12_ PA12,GPIO_AF9
#define CAN1_TX_PB9_ PB9,GPIO_AF9
#define CAN1_TX_PD1_ PD1,GPIO_AF9
#define CAN1_TX_PH13_ PH13,GPIO_AF9
#define _CAN1_TX_PA12_ 1
#define _CAN1_TX_PB9_ 1
#define _CAN1_TX_PD1_ 1
#define _CAN1_TX_PH13_ 1

#define COMP1_OUT_PB0_ PB0,GPIO_AF12
#define COMP1_OUT_PB10_ PB10,GPIO_AF12
#define _COMP1_OUT_PB0_ 1
#define _COMP1_OUT_PB10_ 1

#define COMP2_OUT_PB11_ PB11,GPIO_AF12
#define COMP2_OUT_PB5_ PB5,GPIO_AF12
#define _COMP2_OUT_PB11_ 1
#define _COMP2_OUT_PB5_ 1

#define CRS_SYNC_PB3 (JTDO/TRACESWO)_ PB3 (JTDO/TRACESWO),GPIO_AF10
#define _CRS_SYNC_PB3 (JTDO/TRACESWO)_ 1

#define DCMI_D0_PA9_ PA9,GPIO_AF5
#define DCMI_D0_PC6_ PC6,GPIO_AF10
#define DCMI_D0_PH9_ PH9,GPIO_AF10
#define _DCMI_D0_PA9_ 1
#define _DCMI_D0_PC6_ 1
#define _DCMI_D0_PH9_ 1

#define DCMI_D1_PA10_ PA10,GPIO_AF5
#define DCMI_D1_PC7_ PC7,GPIO_AF10
#define DCMI_D1_PH10_ PH10,GPIO_AF10
#define _DCMI_D1_PA10_ 1
#define _DCMI_D1_PC7_ 1
#define _DCMI_D1_PH10_ 1

#define DCMI_D10_PB5_ PB5,GPIO_AF10
#define DCMI_D10_PD6_ PD6,GPIO_AF4
#define DCMI_D10_PI3_ PI3,GPIO_AF10
#define _DCMI_D10_PB5_ 1
#define _DCMI_D10_PD6_ 1
#define _DCMI_D10_PI3_ 1

#define DCMI_D11_PD2_ PD2,GPIO_AF10
#define DCMI_D11_PF10_ PF10,GPIO_AF10
#define DCMI_D11_PH15_ PH15,GPIO_AF10
#define _DCMI_D11_PD2_ 1
#define _DCMI_D11_PF10_ 1
#define _DCMI_D11_PH15_ 1

#define DCMI_D12_PB4 (NJTRST)_ PB4 (NJTRST),GPIO_AF10
#define DCMI_D12_PF11_ PF11,GPIO_AF10
#define DCMI_D12_PI8_ PI8,GPIO_AF10
#define _DCMI_D12_PB4 (NJTRST)_ 1
#define _DCMI_D12_PF11_ 1
#define _DCMI_D12_PI8_ 1

#define DCMI_D13_PG15_ PG15,GPIO_AF10
#define DCMI_D13_PI0_ PI0,GPIO_AF10
#define _DCMI_D13_PG15_ 1
#define _DCMI_D13_PI0_ 1

#define DCMI_D2_PC11_ PC11,GPIO_AF4
#define DCMI_D2_PC8_ PC8,GPIO_AF10
#define DCMI_D2_PE0_ PE0,GPIO_AF10
#define DCMI_D2_PH11_ PH11,GPIO_AF10
#define _DCMI_D2_PC11_ 1
#define _DCMI_D2_PC8_ 1
#define _DCMI_D2_PE0_ 1
#define _DCMI_D2_PH11_ 1

#define DCMI_D3_PC9_ PC9,GPIO_AF4
#define DCMI_D3_PE1_ PE1,GPIO_AF10
#define DCMI_D3_PH12_ PH12,GPIO_AF10
#define _DCMI_D3_PC9_ 1
#define _DCMI_D3_PE1_ 1
#define _DCMI_D3_PH12_ 1

#define DCMI_D4_PC11_ PC11,GPIO_AF10
#define DCMI_D4_PE4_ PE4,GPIO_AF10
#define DCMI_D4_PH14_ PH14,GPIO_AF10
#define _DCMI_D4_PC11_ 1
#define _DCMI_D4_PE4_ 1
#define _DCMI_D4_PH14_ 1

#define DCMI_D5_PB6_ PB6,GPIO_AF10
#define DCMI_D5_PD3_ PD3,GPIO_AF4
#define DCMI_D5_PI4_ PI4,GPIO_AF10
#define _DCMI_D5_PB6_ 1
#define _DCMI_D5_PD3_ 1
#define _DCMI_D5_PI4_ 1

#define DCMI_D6_PB8_ PB8,GPIO_AF10
#define DCMI_D6_PE5_ PE5,GPIO_AF10
#define DCMI_D6_PI6_ PI6,GPIO_AF10
#define _DCMI_D6_PB8_ 1
#define _DCMI_D6_PE5_ 1
#define _DCMI_D6_PI6_ 1

#define DCMI_D7_PB9_ PB9,GPIO_AF10
#define DCMI_D7_PE6_ PE6,GPIO_AF10
#define DCMI_D7_PI7_ PI7,GPIO_AF10
#define _DCMI_D7_PB9_ 1
#define _DCMI_D7_PE6_ 1
#define _DCMI_D7_PI7_ 1

#define DCMI_D8_PC10_ PC10,GPIO_AF10
#define DCMI_D8_PH6_ PH6,GPIO_AF10
#define DCMI_D8_PI1_ PI1,GPIO_AF10
#define _DCMI_D8_PC10_ 1
#define _DCMI_D8_PH6_ 1
#define _DCMI_D8_PI1_ 1

#define DCMI_D9_PC12_ PC12,GPIO_AF10
#define DCMI_D9_PH7_ PH7,GPIO_AF10
#define DCMI_D9_PI2_ PI2,GPIO_AF10
#define _DCMI_D9_PC12_ 1
#define _DCMI_D9_PH7_ 1
#define _DCMI_D9_PI2_ 1

#define DCMI_HSYNC_PA4_ PA4,GPIO_AF10
#define DCMI_HSYNC_PD8_ PD8,GPIO_AF10
#define DCMI_HSYNC_PH8_ PH8,GPIO_AF10
#define _DCMI_HSYNC_PA4_ 1
#define _DCMI_HSYNC_PD8_ 1
#define _DCMI_HSYNC_PH8_ 1

#define DCMI_PIXCLK_PA6_ PA6,GPIO_AF4
#define DCMI_PIXCLK_PD9_ PD9,GPIO_AF10
#define DCMI_PIXCLK_PH5_ PH5,GPIO_AF10
#define _DCMI_PIXCLK_PA6_ 1
#define _DCMI_PIXCLK_PD9_ 1
#define _DCMI_PIXCLK_PH5_ 1

#define DCMI_VSYNC_PB7_ PB7,GPIO_AF10
#define DCMI_VSYNC_PI5_ PI5,GPIO_AF10
#define _DCMI_VSYNC_PB7_ 1
#define _DCMI_VSYNC_PI5_ 1

#define DFSDM1_CKIN0_PB2_ PB2,GPIO_AF6
#define DFSDM1_CKIN0_PD4_ PD4,GPIO_AF6
#define _DFSDM1_CKIN0_PB2_ 1
#define _DFSDM1_CKIN0_PD4_ 1

#define DFSDM1_CKIN1_PB13_ PB13,GPIO_AF6
#define DFSDM1_CKIN1_PD7_ PD7,GPIO_AF6
#define _DFSDM1_CKIN1_PB13_ 1
#define _DFSDM1_CKIN1_PD7_ 1

#define DFSDM1_CKIN2_PB15_ PB15,GPIO_AF6
#define DFSDM1_CKIN2_PE8_ PE8,GPIO_AF6
#define _DFSDM1_CKIN2_PB15_ 1
#define _DFSDM1_CKIN2_PE8_ 1

#define DFSDM1_CKIN3_PC6_ PC6,GPIO_AF6
#define DFSDM1_CKIN3_PE5_ PE5,GPIO_AF6
#define _DFSDM1_CKIN3_PC6_ 1
#define _DFSDM1_CKIN3_PE5_ 1

#define DFSDM1_CKIN4_PC1_ PC1,GPIO_AF6
#define DFSDM1_CKIN4_PE11_ PE11,GPIO_AF6
#define _DFSDM1_CKIN4_PC1_ 1
#define _DFSDM1_CKIN4_PE11_ 1

#define DFSDM1_CKIN5_PB7_ PB7,GPIO_AF6
#define DFSDM1_CKIN5_PE13_ PE13,GPIO_AF6
#define _DFSDM1_CKIN5_PB7_ 1
#define _DFSDM1_CKIN5_PE13_ 1

#define DFSDM1_CKIN6_PB9_ PB9,GPIO_AF6
#define DFSDM1_CKIN6_PF14_ PF14,GPIO_AF6
#define _DFSDM1_CKIN6_PB9_ 1
#define _DFSDM1_CKIN6_PF14_ 1

#define DFSDM1_CKIN7_PB11_ PB11,GPIO_AF6
#define DFSDM1_CKIN7_PD1_ PD1,GPIO_AF6
#define _DFSDM1_CKIN7_PB11_ 1
#define _DFSDM1_CKIN7_PD1_ 1

#define DFSDM1_CKOUT_PB8_ PB8,GPIO_AF5
#define DFSDM1_CKOUT_PC2_ PC2,GPIO_AF6
#define DFSDM1_CKOUT_PE9_ PE9,GPIO_AF6
#define DFSDM1_CKOUT_PF10_ PF10,GPIO_AF6
#define DFSDM1_CKOUT_PG7_ PG7,GPIO_AF6
#define _DFSDM1_CKOUT_PB8_ 1
#define _DFSDM1_CKOUT_PC2_ 1
#define _DFSDM1_CKOUT_PE9_ 1
#define _DFSDM1_CKOUT_PF10_ 1
#define _DFSDM1_CKOUT_PG7_ 1

#define DFSDM1_DATIN0_PB1_ PB1,GPIO_AF6
#define DFSDM1_DATIN0_PD3_ PD3,GPIO_AF6
#define _DFSDM1_DATIN0_PB1_ 1
#define _DFSDM1_DATIN0_PD3_ 1

#define DFSDM1_DATIN1_PB12_ PB12,GPIO_AF6
#define DFSDM1_DATIN1_PD6_ PD6,GPIO_AF6
#define _DFSDM1_DATIN1_PB12_ 1
#define _DFSDM1_DATIN1_PD6_ 1

#define DFSDM1_DATIN2_PB14_ PB14,GPIO_AF6
#define DFSDM1_DATIN2_PE7_ PE7,GPIO_AF6
#define _DFSDM1_DATIN2_PB14_ 1
#define _DFSDM1_DATIN2_PE7_ 1

#define DFSDM1_DATIN3_PC7_ PC7,GPIO_AF6
#define DFSDM1_DATIN3_PE4_ PE4,GPIO_AF6
#define _DFSDM1_DATIN3_PC7_ 1
#define _DFSDM1_DATIN3_PE4_ 1

#define DFSDM1_DATIN4_PC0_ PC0,GPIO_AF6
#define DFSDM1_DATIN4_PE10_ PE10,GPIO_AF6
#define _DFSDM1_DATIN4_PC0_ 1
#define _DFSDM1_DATIN4_PE10_ 1

#define DFSDM1_DATIN5_PB6_ PB6,GPIO_AF6
#define DFSDM1_DATIN5_PE12_ PE12,GPIO_AF6
#define _DFSDM1_DATIN5_PB6_ 1
#define _DFSDM1_DATIN5_PE12_ 1

#define DFSDM1_DATIN6_PB8_ PB8,GPIO_AF6
#define DFSDM1_DATIN6_PF13_ PF13,GPIO_AF6
#define _DFSDM1_DATIN6_PB8_ 1
#define _DFSDM1_DATIN6_PF13_ 1

#define DFSDM1_DATIN7_PB10_ PB10,GPIO_AF6
#define DFSDM1_DATIN7_PD0_ PD0,GPIO_AF6
#define _DFSDM1_DATIN7_PB10_ 1
#define _DFSDM1_DATIN7_PD0_ 1

#define DSIHOST_TE_PB11_ PB11,GPIO_AF11
#define DSIHOST_TE_PB7_ PB7,GPIO_AF11
#define DSIHOST_TE_PF11_ PF11,GPIO_AF11
#define DSIHOST_TE_PG6_ PG6,GPIO_AF11
#define _DSIHOST_TE_PB11_ 1
#define _DSIHOST_TE_PB7_ 1
#define _DSIHOST_TE_PF11_ 1
#define _DSIHOST_TE_PG6_ 1

#define EVENTOUT_PA0_ PA0,GPIO_AF15
#define EVENTOUT_PA1_ PA1,GPIO_AF15
#define EVENTOUT_PA10_ PA10,GPIO_AF15
#define EVENTOUT_PA11_ PA11,GPIO_AF15
#define EVENTOUT_PA12_ PA12,GPIO_AF15
#define EVENTOUT_PA13 (JTMS/SWDIO)_ PA13 (JTMS/SWDIO),GPIO_AF15
#define EVENTOUT_PA14 (JTCK/SWCLK)_ PA14 (JTCK/SWCLK),GPIO_AF15
#define EVENTOUT_PA15 (JTDI)_ PA15 (JTDI),GPIO_AF15
#define EVENTOUT_PA2_ PA2,GPIO_AF15
#define EVENTOUT_PA3_ PA3,GPIO_AF15
#define EVENTOUT_PA4_ PA4,GPIO_AF15
#define EVENTOUT_PA5_ PA5,GPIO_AF15
#define EVENTOUT_PA6_ PA6,GPIO_AF15
#define EVENTOUT_PA7_ PA7,GPIO_AF15
#define EVENTOUT_PA8_ PA8,GPIO_AF15
#define EVENTOUT_PA9_ PA9,GPIO_AF15
#define EVENTOUT_PB0_ PB0,GPIO_AF15
#define EVENTOUT_PB1_ PB1,GPIO_AF15
#define EVENTOUT_PB10_ PB10,GPIO_AF15
#define EVENTOUT_PB11_ PB11,GPIO_AF15
#define EVENTOUT_PB12_ PB12,GPIO_AF15
#define EVENTOUT_PB13_ PB13,GPIO_AF15
#define EVENTOUT_PB14_ PB14,GPIO_AF15
#define EVENTOUT_PB15_ PB15,GPIO_AF15
#define EVENTOUT_PB2_ PB2,GPIO_AF15
#define EVENTOUT_PB3 (JTDO/TRACESWO)_ PB3 (JTDO/TRACESWO),GPIO_AF15
#define EVENTOUT_PB4 (NJTRST)_ PB4 (NJTRST),GPIO_AF15
#define EVENTOUT_PB5_ PB5,GPIO_AF15
#define EVENTOUT_PB6_ PB6,GPIO_AF15
#define EVENTOUT_PB7_ PB7,GPIO_AF15
#define EVENTOUT_PB8_ PB8,GPIO_AF15
#define EVENTOUT_PB9_ PB9,GPIO_AF15
#define EVENTOUT_PC0_ PC0,GPIO_AF15
#define EVENTOUT_PC1_ PC1,GPIO_AF15
#define EVENTOUT_PC10_ PC10,GPIO_AF15
#define EVENTOUT_PC11_ PC11,GPIO_AF15
#define EVENTOUT_PC12_ PC12,GPIO_AF15
#define EVENTOUT_PC13_ PC13,GPIO_AF15
#define EVENTOUT_PC14_ PC14,GPIO_AF15
#define EVENTOUT_PC15_ PC15,GPIO_AF15
#define EVENTOUT_PC2_ PC2,GPIO_AF15
#define EVENTOUT_PC3_ PC3,GPIO_AF15
#define EVENTOUT_PC4_ PC4,GPIO_AF15
#define EVENTOUT_PC5_ PC5,GPIO_AF15
#define EVENTOUT_PC6_ PC6,GPIO_AF15
#define EVENTOUT_PC7_ PC7,GPIO_AF15
#define EVENTOUT_PC8_ PC8,GPIO_AF15
#define EVENTOUT_PC9_ PC9,GPIO_AF15
#define EVENTOUT_PD0_ PD0,GPIO_AF15
#define EVENTOUT_PD1_ PD1,GPIO_AF15
#define EVENTOUT_PD10_ PD10,GPIO_AF15
#define EVENTOUT_PD11_ PD11,GPIO_AF15
#define EVENTOUT_PD12_ PD12,GPIO_AF15
#define EVENTOUT_PD13_ PD13,GPIO_AF15
#define EVENTOUT_PD14_ PD14,GPIO_AF15
#define EVENTOUT_PD15_ PD15,GPIO_AF15
#define EVENTOUT_PD2_ PD2,GPIO_AF15
#define EVENTOUT_PD3_ PD3,GPIO_AF15
#define EVENTOUT_PD4_ PD4,GPIO_AF15
#define EVENTOUT_PD5_ PD5,GPIO_AF15
#define EVENTOUT_PD6_ PD6,GPIO_AF15
#define EVENTOUT_PD7_ PD7,GPIO_AF15
#define EVENTOUT_PD8_ PD8,GPIO_AF15
#define EVENTOUT_PD9_ PD9,GPIO_AF15
#define EVENTOUT_PE0_ PE0,GPIO_AF15
#define EVENTOUT_PE1_ PE1,GPIO_AF15
#define EVENTOUT_PE10_ PE10,GPIO_AF15
#define EVENTOUT_PE11_ PE11,GPIO_AF15
#define EVENTOUT_PE12_ PE12,GPIO_AF15
#define EVENTOUT_PE13_ PE13,GPIO_AF15
#define EVENTOUT_PE14_ PE14,GPIO_AF15
#define EVENTOUT_PE15_ PE15,GPIO_AF15
#define EVENTOUT_PE2_ PE2,GPIO_AF15
#define EVENTOUT_PE3_ PE3,GPIO_AF15
#define EVENTOUT_PE4_ PE4,GPIO_AF15
#define EVENTOUT_PE5_ PE5,GPIO_AF15
#define EVENTOUT_PE6_ PE6,GPIO_AF15
#define EVENTOUT_PE7_ PE7,GPIO_AF15
#define EVENTOUT_PE8_ PE8,GPIO_AF15
#define EVENTOUT_PE9_ PE9,GPIO_AF15
#define EVENTOUT_PF0_ PF0,GPIO_AF15
#define EVENTOUT_PF1_ PF1,GPIO_AF15
#define EVENTOUT_PF10_ PF10,GPIO_AF15
#define EVENTOUT_PF11_ PF11,GPIO_AF15
#define EVENTOUT_PF12_ PF12,GPIO_AF15
#define EVENTOUT_PF13_ PF13,GPIO_AF15
#define EVENTOUT_PF14_ PF14,GPIO_AF15
#define EVENTOUT_PF15_ PF15,GPIO_AF15
#define EVENTOUT_PF2_ PF2,GPIO_AF15
#define EVENTOUT_PF3_ PF3,GPIO_AF15
#define EVENTOUT_PF4_ PF4,GPIO_AF15
#define EVENTOUT_PF5_ PF5,GPIO_AF15
#define EVENTOUT_PF6_ PF6,GPIO_AF15
#define EVENTOUT_PF7_ PF7,GPIO_AF15
#define EVENTOUT_PF8_ PF8,GPIO_AF15
#define EVENTOUT_PF9_ PF9,GPIO_AF15
#define EVENTOUT_PG0_ PG0,GPIO_AF15
#define EVENTOUT_PG1_ PG1,GPIO_AF15
#define EVENTOUT_PG10_ PG10,GPIO_AF15
#define EVENTOUT_PG11_ PG11,GPIO_AF15
#define EVENTOUT_PG12_ PG12,GPIO_AF15
#define EVENTOUT_PG13_ PG13,GPIO_AF15
#define EVENTOUT_PG14_ PG14,GPIO_AF15
#define EVENTOUT_PG15_ PG15,GPIO_AF15
#define EVENTOUT_PG2_ PG2,GPIO_AF15
#define EVENTOUT_PG3_ PG3,GPIO_AF15
#define EVENTOUT_PG4_ PG4,GPIO_AF15
#define EVENTOUT_PG5_ PG5,GPIO_AF15
#define EVENTOUT_PG6_ PG6,GPIO_AF15
#define EVENTOUT_PG7_ PG7,GPIO_AF15
#define EVENTOUT_PG8_ PG8,GPIO_AF15
#define EVENTOUT_PG9_ PG9,GPIO_AF15
#define EVENTOUT_PH0_ PH0,GPIO_AF15
#define EVENTOUT_PH1_ PH1,GPIO_AF15
#define EVENTOUT_PH10_ PH10,GPIO_AF15
#define EVENTOUT_PH11_ PH11,GPIO_AF15
#define EVENTOUT_PH12_ PH12,GPIO_AF15
#define EVENTOUT_PH13_ PH13,GPIO_AF15
#define EVENTOUT_PH14_ PH14,GPIO_AF15
#define EVENTOUT_PH15_ PH15,GPIO_AF15
#define EVENTOUT_PH2_ PH2,GPIO_AF15
#define EVENTOUT_PH3_ PH3,GPIO_AF15
#define EVENTOUT_PH4_ PH4,GPIO_AF15
#define EVENTOUT_PH5_ PH5,GPIO_AF15
#define EVENTOUT_PH6_ PH6,GPIO_AF15
#define EVENTOUT_PH7_ PH7,GPIO_AF15
#define EVENTOUT_PH8_ PH8,GPIO_AF15
#define EVENTOUT_PH9_ PH9,GPIO_AF15
#define EVENTOUT_PI0_ PI0,GPIO_AF15
#define EVENTOUT_PI1_ PI1,GPIO_AF15
#define EVENTOUT_PI10_ PI10,GPIO_AF15
#define EVENTOUT_PI11_ PI11,GPIO_AF15
#define EVENTOUT_PI2_ PI2,GPIO_AF15
#define EVENTOUT_PI3_ PI3,GPIO_AF15
#define EVENTOUT_PI4_ PI4,GPIO_AF15
#define EVENTOUT_PI5_ PI5,GPIO_AF15
#define EVENTOUT_PI6_ PI6,GPIO_AF15
#define EVENTOUT_PI7_ PI7,GPIO_AF15
#define EVENTOUT_PI8_ PI8,GPIO_AF15
#define EVENTOUT_PI9_ PI9,GPIO_AF15
#define _EVENTOUT_PA0_ 1
#define _EVENTOUT_PA1_ 1
#define _EVENTOUT_PA10_ 1
#define _EVENTOUT_PA11_ 1
#define _EVENTOUT_PA12_ 1
#define _EVENTOUT_PA13 (JTMS/SWDIO)_ 1
#define _EVENTOUT_PA14 (JTCK/SWCLK)_ 1
#define _EVENTOUT_PA15 (JTDI)_ 1
#define _EVENTOUT_PA2_ 1
#define _EVENTOUT_PA3_ 1
#define _EVENTOUT_PA4_ 1
#define _EVENTOUT_PA5_ 1
#define _EVENTOUT_PA6_ 1
#define _EVENTOUT_PA7_ 1
#define _EVENTOUT_PA8_ 1
#define _EVENTOUT_PA9_ 1
#define _EVENTOUT_PB0_ 1
#define _EVENTOUT_PB1_ 1
#define _EVENTOUT_PB10_ 1
#define _EVENTOUT_PB11_ 1
#define _EVENTOUT_PB12_ 1
#define _EVENTOUT_PB13_ 1
#define _EVENTOUT_PB14_ 1
#define _EVENTOUT_PB15_ 1
#define _EVENTOUT_PB2_ 1
#define _EVENTOUT_PB3 (JTDO/TRACESWO)_ 1
#define _EVENTOUT_PB4 (NJTRST)_ 1
#define _EVENTOUT_PB5_ 1
#define _EVENTOUT_PB6_ 1
#define _EVENTOUT_PB7_ 1
#define _EVENTOUT_PB8_ 1
#define _EVENTOUT_PB9_ 1
#define _EVENTOUT_PC0_ 1
#define _EVENTOUT_PC1_ 1
#define _EVENTOUT_PC10_ 1
#define _EVENTOUT_PC11_ 1
#define _EVENTOUT_PC12_ 1
#define _EVENTOUT_PC13_ 1
#define _EVENTOUT_PC14_ 1
#define _EVENTOUT_PC15_ 1
#define _EVENTOUT_PC2_ 1
#define _EVENTOUT_PC3_ 1
#define _EVENTOUT_PC4_ 1
#define _EVENTOUT_PC5_ 1
#define _EVENTOUT_PC6_ 1
#define _EVENTOUT_PC7_ 1
#define _EVENTOUT_PC8_ 1
#define _EVENTOUT_PC9_ 1
#define _EVENTOUT_PD0_ 1
#define _EVENTOUT_PD1_ 1
#define _EVENTOUT_PD10_ 1
#define _EVENTOUT_PD11_ 1
#define _EVENTOUT_PD12_ 1
#define _EVENTOUT_PD13_ 1
#define _EVENTOUT_PD14_ 1
#define _EVENTOUT_PD15_ 1
#define _EVENTOUT_PD2_ 1
#define _EVENTOUT_PD3_ 1
#define _EVENTOUT_PD4_ 1
#define _EVENTOUT_PD5_ 1
#define _EVENTOUT_PD6_ 1
#define _EVENTOUT_PD7_ 1
#define _EVENTOUT_PD8_ 1
#define _EVENTOUT_PD9_ 1
#define _EVENTOUT_PE0_ 1
#define _EVENTOUT_PE1_ 1
#define _EVENTOUT_PE10_ 1
#define _EVENTOUT_PE11_ 1
#define _EVENTOUT_PE12_ 1
#define _EVENTOUT_PE13_ 1
#define _EVENTOUT_PE14_ 1
#define _EVENTOUT_PE15_ 1
#define _EVENTOUT_PE2_ 1
#define _EVENTOUT_PE3_ 1
#define _EVENTOUT_PE4_ 1
#define _EVENTOUT_PE5_ 1
#define _EVENTOUT_PE6_ 1
#define _EVENTOUT_PE7_ 1
#define _EVENTOUT_PE8_ 1
#define _EVENTOUT_PE9_ 1
#define _EVENTOUT_PF0_ 1
#define _EVENTOUT_PF1_ 1
#define _EVENTOUT_PF10_ 1
#define _EVENTOUT_PF11_ 1
#define _EVENTOUT_PF12_ 1
#define _EVENTOUT_PF13_ 1
#define _EVENTOUT_PF14_ 1
#define _EVENTOUT_PF15_ 1
#define _EVENTOUT_PF2_ 1
#define _EVENTOUT_PF3_ 1
#define _EVENTOUT_PF4_ 1
#define _EVENTOUT_PF5_ 1
#define _EVENTOUT_PF6_ 1
#define _EVENTOUT_PF7_ 1
#define _EVENTOUT_PF8_ 1
#define _EVENTOUT_PF9_ 1
#define _EVENTOUT_PG0_ 1
#define _EVENTOUT_PG1_ 1
#define _EVENTOUT_PG10_ 1
#define _EVENTOUT_PG11_ 1
#define _EVENTOUT_PG12_ 1
#define _EVENTOUT_PG13_ 1
#define _EVENTOUT_PG14_ 1
#define _EVENTOUT_PG15_ 1
#define _EVENTOUT_PG2_ 1
#define _EVENTOUT_PG3_ 1
#define _EVENTOUT_PG4_ 1
#define _EVENTOUT_PG5_ 1
#define _EVENTOUT_PG6_ 1
#define _EVENTOUT_PG7_ 1
#define _EVENTOUT_PG8_ 1
#define _EVENTOUT_PG9_ 1
#define _EVENTOUT_PH0_ 1
#define _EVENTOUT_PH1_ 1
#define _EVENTOUT_PH10_ 1
#define _EVENTOUT_PH11_ 1
#define _EVENTOUT_PH12_ 1
#define _EVENTOUT_PH13_ 1
#define _EVENTOUT_PH14_ 1
#define _EVENTOUT_PH15_ 1
#define _EVENTOUT_PH2_ 1
#define _EVENTOUT_PH3_ 1
#define _EVENTOUT_PH4_ 1
#define _EVENTOUT_PH5_ 1
#define _EVENTOUT_PH6_ 1
#define _EVENTOUT_PH7_ 1
#define _EVENTOUT_PH8_ 1
#define _EVENTOUT_PH9_ 1
#define _EVENTOUT_PI0_ 1
#define _EVENTOUT_PI1_ 1
#define _EVENTOUT_PI10_ 1
#define _EVENTOUT_PI11_ 1
#define _EVENTOUT_PI2_ 1
#define _EVENTOUT_PI3_ 1
#define _EVENTOUT_PI4_ 1
#define _EVENTOUT_PI5_ 1
#define _EVENTOUT_PI6_ 1
#define _EVENTOUT_PI7_ 1
#define _EVENTOUT_PI8_ 1
#define _EVENTOUT_PI9_ 1

