susanw1/zscript/receivers/generic-c++/zll/arm/implementations/src/main/c++/stm32/AlternateFunction/STM32L4Rx.h
#define I2C4_SMBA_PA14 (JTCK/SWCLK)_ PA14 (JTCK/SWCLK),GPIO_AF5
#define I2C4_SMBA_PD11_ PD11,GPIO_AF4
#define I2C4_SMBA_PF13_ PF13,GPIO_AF4
#define _I2C4_SMBA_PA14 (JTCK/SWCLK)_ 1
#define _I2C4_SMBA_PD11_ 1
#define _I2C4_SMBA_PF13_ 1

#define IR_OUT_PA13 (JTMS/SWDIO)_ PA13 (JTMS/SWDIO),GPIO_AF1
#define IR_OUT_PB9_ PB9,GPIO_AF1
#define _IR_OUT_PA13 (JTMS/SWDIO)_ 1
#define _IR_OUT_PB9_ 1

#define LPTIM1_ETR_PB6_ PB6,GPIO_AF1
#define LPTIM1_ETR_PC3_ PC3,GPIO_AF1
#define LPTIM1_ETR_PG12_ PG12,GPIO_AF1
#define _LPTIM1_ETR_PB6_ 1
#define _LPTIM1_ETR_PC3_ 1
#define _LPTIM1_ETR_PG12_ 1

#define LPTIM1_IN1_PB5_ PB5,GPIO_AF1
#define LPTIM1_IN1_PC0_ PC0,GPIO_AF1
#define LPTIM1_IN1_PG10_ PG10,GPIO_AF1
#define _LPTIM1_IN1_PB5_ 1
#define _LPTIM1_IN1_PC0_ 1
#define _LPTIM1_IN1_PG10_ 1

#define LPTIM1_IN2_PB7_ PB7,GPIO_AF1
#define LPTIM1_IN2_PC2_ PC2,GPIO_AF1
#define LPTIM1_IN2_PG11_ PG11,GPIO_AF1
#define _LPTIM1_IN2_PB7_ 1
#define _LPTIM1_IN2_PC2_ 1
#define _LPTIM1_IN2_PG11_ 1

#define LPTIM1_OUT_PA14 (JTCK/SWCLK)_ PA14 (JTCK/SWCLK),GPIO_AF1
#define LPTIM1_OUT_PB2_ PB2,GPIO_AF1
#define LPTIM1_OUT_PC1_ PC1,GPIO_AF1
#define LPTIM1_OUT_PG15_ PG15,GPIO_AF1
#define _LPTIM1_OUT_PA14 (JTCK/SWCLK)_ 1
#define _LPTIM1_OUT_PB2_ 1
#define _LPTIM1_OUT_PC1_ 1
#define _LPTIM1_OUT_PG15_ 1

#define LPTIM2_ETR_PA5_ PA5,GPIO_AF14
#define LPTIM2_ETR_PC3_ PC3,GPIO_AF14
#define LPTIM2_ETR_PD11_ PD11,GPIO_AF14
#define _LPTIM2_ETR_PA5_ 1
#define _LPTIM2_ETR_PC3_ 1
#define _LPTIM2_ETR_PD11_ 1

#define LPTIM2_IN1_PB1_ PB1,GPIO_AF14
#define LPTIM2_IN1_PC0_ PC0,GPIO_AF14
#define LPTIM2_IN1_PD12_ PD12,GPIO_AF14
#define _LPTIM2_IN1_PB1_ 1
#define _LPTIM2_IN1_PC0_ 1
#define _LPTIM2_IN1_PD12_ 1

#define LPTIM2_OUT_PA4_ PA4,GPIO_AF14
#define LPTIM2_OUT_PA8_ PA8,GPIO_AF14
#define LPTIM2_OUT_PD13_ PD13,GPIO_AF14
#define _LPTIM2_OUT_PA4_ 1
#define _LPTIM2_OUT_PA8_ 1
#define _LPTIM2_OUT_PD13_ 1

#define LPUART1_CTS_PA6_ PA6,GPIO_AF8
#define LPUART1_CTS_PB13_ PB13,GPIO_AF8
#define LPUART1_CTS_PG5_ PG5,GPIO_AF8
#define _LPUART1_CTS_PA6_ 1
#define _LPUART1_CTS_PB13_ 1
#define _LPUART1_CTS_PG5_ 1

#define LPUART1_DE_PB1_ PB1,GPIO_AF8
#define LPUART1_DE_PB12_ PB12,GPIO_AF8
#define LPUART1_DE_PG6_ PG6,GPIO_AF8
#define _LPUART1_DE_PB1_ 1
#define _LPUART1_DE_PB12_ 1
#define _LPUART1_DE_PG6_ 1

#define LPUART1_RTS_PB1_ PB1,GPIO_AF8
#define LPUART1_RTS_PB12_ PB12,GPIO_AF8
#define LPUART1_RTS_PG6_ PG6,GPIO_AF8
#define _LPUART1_RTS_PB1_ 1
#define _LPUART1_RTS_PB12_ 1
#define _LPUART1_RTS_PG6_ 1

#define LPUART1_RX_PA3_ PA3,GPIO_AF8
#define LPUART1_RX_PB10_ PB10,GPIO_AF8
#define LPUART1_RX_PC0_ PC0,GPIO_AF8
#define LPUART1_RX_PG8_ PG8,GPIO_AF8
#define _LPUART1_RX_PA3_ 1
#define _LPUART1_RX_PB10_ 1
#define _LPUART1_RX_PC0_ 1
#define _LPUART1_RX_PG8_ 1

#define LPUART1_TX_PA2_ PA2,GPIO_AF8
#define LPUART1_TX_PB11_ PB11,GPIO_AF8
#define LPUART1_TX_PC1_ PC1,GPIO_AF8
#define LPUART1_TX_PG7_ PG7,GPIO_AF8
#define _LPUART1_TX_PA2_ 1
#define _LPUART1_TX_PB11_ 1
#define _LPUART1_TX_PC1_ 1
#define _LPUART1_TX_PG7_ 1

#define LTDC_B0_PE4_ PE4,GPIO_AF11
#define LTDC_B0_PF12_ PF12,GPIO_AF11
#define _LTDC_B0_PE4_ 1
#define _LTDC_B0_PF12_ 1

#define LTDC_B1_PB2_ PB2,GPIO_AF11
#define LTDC_B1_PB8_ PB8,GPIO_AF11
#define LTDC_B1_PF13_ PF13,GPIO_AF11
#define _LTDC_B1_PB2_ 1
#define _LTDC_B1_PB8_ 1
#define _LTDC_B1_PF13_ 1

#define LTDC_B2_PD14_ PD14,GPIO_AF11
#define _LTDC_B2_PD14_ 1

#define LTDC_B3_PD15_ PD15,GPIO_AF11
#define _LTDC_B3_PD15_ 1

#define LTDC_B4_PD0_ PD0,GPIO_AF11
#define _LTDC_B4_PD0_ 1

#define LTDC_B5_PD1_ PD1,GPIO_AF11
#define _LTDC_B5_PD1_ 1

#define LTDC_B6_PE7_ PE7,GPIO_AF11
#define _LTDC_B6_PE7_ 1

#define LTDC_B7_PE8_ PE8,GPIO_AF11
#define _LTDC_B7_PE8_ 1

#define LTDC_CLK_PD3_ PD3,GPIO_AF11
#define _LTDC_CLK_PD3_ 1

#define LTDC_DE_PD6_ PD6,GPIO_AF11
#define LTDC_DE_PF11_ PF11,GPIO_AF9
#define _LTDC_DE_PD6_ 1
#define _LTDC_DE_PF11_ 1

#define LTDC_G0_PE5_ PE5,GPIO_AF11
#define LTDC_G0_PF14_ PF14,GPIO_AF11
#define _LTDC_G0_PE5_ 1
#define _LTDC_G0_PF14_ 1

#define LTDC_G1_PE6_ PE6,GPIO_AF11
#define LTDC_G1_PF15_ PF15,GPIO_AF11
#define _LTDC_G1_PE6_ 1
#define _LTDC_G1_PF15_ 1

#define LTDC_G2_PE9_ PE9,GPIO_AF11
#define _LTDC_G2_PE9_ 1

#define LTDC_G3_PE10_ PE10,GPIO_AF11
#define _LTDC_G3_PE10_ 1

#define LTDC_G4_PE11_ PE11,GPIO_AF11
#define _LTDC_G4_PE11_ 1

#define LTDC_G5_PE12_ PE12,GPIO_AF11
#define _LTDC_G5_PE12_ 1

#define LTDC_G6_PE13_ PE13,GPIO_AF11
#define _LTDC_G6_PE13_ 1

#define LTDC_G7_PE14_ PE14,GPIO_AF11
#define _LTDC_G7_PE14_ 1

#define LTDC_HSYNC_PE0_ PE0,GPIO_AF11
#define _LTDC_HSYNC_PE0_ 1

#define LTDC_R0_PC6_ PC6,GPIO_AF11
#define LTDC_R0_PE2_ PE2,GPIO_AF11
#define LTDC_R0_PG13_ PG13,GPIO_AF11
#define _LTDC_R0_PC6_ 1
#define _LTDC_R0_PE2_ 1
#define _LTDC_R0_PG13_ 1

#define LTDC_R1_PC7_ PC7,GPIO_AF11
#define LTDC_R1_PE3_ PE3,GPIO_AF11
#define LTDC_R1_PG14_ PG14,GPIO_AF11
#define LTDC_R1_PG6_ PG6,GPIO_AF9
#define _LTDC_R1_PC7_ 1
#define _LTDC_R1_PE3_ 1
#define _LTDC_R1_PG14_ 1
#define _LTDC_R1_PG6_ 1

#define LTDC_R2_PE15_ PE15,GPIO_AF11
#define _LTDC_R2_PE15_ 1

#define LTDC_R3_PD8_ PD8,GPIO_AF11
#define _LTDC_R3_PD8_ 1

#define LTDC_R4_PD9_ PD9,GPIO_AF11
#define _LTDC_R4_PD9_ 1

#define LTDC_R5_PD10_ PD10,GPIO_AF11
#define _LTDC_R5_PD10_ 1

#define LTDC_R6_PD11_ PD11,GPIO_AF11
#define _LTDC_R6_PD11_ 1

#define LTDC_R7_PD12_ PD12,GPIO_AF11
#define _LTDC_R7_PD12_ 1

#define LTDC_VSYNC_PE1_ PE1,GPIO_AF11
#define _LTDC_VSYNC_PE1_ 1

#define OCTOSPIM_P1_CLK_PA3_ PA3,GPIO_AF10
#define OCTOSPIM_P1_CLK_PB10_ PB10,GPIO_AF10
#define OCTOSPIM_P1_CLK_PE10_ PE10,GPIO_AF10
#define OCTOSPIM_P1_CLK_PF10_ PF10,GPIO_AF3
#define _OCTOSPIM_P1_CLK_PA3_ 1
#define _OCTOSPIM_P1_CLK_PB10_ 1
#define _OCTOSPIM_P1_CLK_PE10_ 1
#define _OCTOSPIM_P1_CLK_PF10_ 1

#define OCTOSPIM_P1_DQS_PA1_ PA1,GPIO_AF10
#define OCTOSPIM_P1_DQS_PB2_ PB2,GPIO_AF10
#define OCTOSPIM_P1_DQS_PE3_ PE3,GPIO_AF3
#define OCTOSPIM_P1_DQS_PG6_ PG6,GPIO_AF3
#define _OCTOSPIM_P1_DQS_PA1_ 1
#define _OCTOSPIM_P1_DQS_PB2_ 1
#define _OCTOSPIM_P1_DQS_PE3_ 1
#define _OCTOSPIM_P1_DQS_PG6_ 1

#define OCTOSPIM_P1_IO0_PB1_ PB1,GPIO_AF10
#define OCTOSPIM_P1_IO0_PE12_ PE12,GPIO_AF10
#define OCTOSPIM_P1_IO0_PF8_ PF8,GPIO_AF10
#define _OCTOSPIM_P1_IO0_PB1_ 1
#define _OCTOSPIM_P1_IO0_PE12_ 1
#define _OCTOSPIM_P1_IO0_PF8_ 1

