susanw1/zscript/receivers/generic-c++/zll/arm/implementations/src/main/c++/stm32/AlternateFunction/STM32L4Rx.h
#define OCTOSPIM_P1_IO1_PB0_ PB0,GPIO_AF10
#define OCTOSPIM_P1_IO1_PE13_ PE13,GPIO_AF10
#define OCTOSPIM_P1_IO1_PF9_ PF9,GPIO_AF10
#define _OCTOSPIM_P1_IO1_PB0_ 1
#define _OCTOSPIM_P1_IO1_PE13_ 1
#define _OCTOSPIM_P1_IO1_PF9_ 1

#define OCTOSPIM_P1_IO2_PA7_ PA7,GPIO_AF10
#define OCTOSPIM_P1_IO2_PE14_ PE14,GPIO_AF10
#define OCTOSPIM_P1_IO2_PF7_ PF7,GPIO_AF10
#define _OCTOSPIM_P1_IO2_PA7_ 1
#define _OCTOSPIM_P1_IO2_PE14_ 1
#define _OCTOSPIM_P1_IO2_PF7_ 1

#define OCTOSPIM_P1_IO3_PA6_ PA6,GPIO_AF10
#define OCTOSPIM_P1_IO3_PE15_ PE15,GPIO_AF10
#define OCTOSPIM_P1_IO3_PF6_ PF6,GPIO_AF10
#define _OCTOSPIM_P1_IO3_PA6_ 1
#define _OCTOSPIM_P1_IO3_PE15_ 1
#define _OCTOSPIM_P1_IO3_PF6_ 1

#define OCTOSPIM_P1_IO4_PC1_ PC1,GPIO_AF10
#define OCTOSPIM_P1_IO4_PD4_ PD4,GPIO_AF10
#define OCTOSPIM_P1_IO4_PH2_ PH2,GPIO_AF3
#define _OCTOSPIM_P1_IO4_PC1_ 1
#define _OCTOSPIM_P1_IO4_PD4_ 1
#define _OCTOSPIM_P1_IO4_PH2_ 1

#define OCTOSPIM_P1_IO5_PC2_ PC2,GPIO_AF10
#define OCTOSPIM_P1_IO5_PD5_ PD5,GPIO_AF10
#define OCTOSPIM_P1_IO5_PG11_ PG11,GPIO_AF3
#define OCTOSPIM_P1_IO5_PI0_ PI0,GPIO_AF3
#define _OCTOSPIM_P1_IO5_PC2_ 1
#define _OCTOSPIM_P1_IO5_PD5_ 1
#define _OCTOSPIM_P1_IO5_PG11_ 1
#define _OCTOSPIM_P1_IO5_PI0_ 1

#define OCTOSPIM_P1_IO6_PC3_ PC3,GPIO_AF10
#define OCTOSPIM_P1_IO6_PD6_ PD6,GPIO_AF10
#define _OCTOSPIM_P1_IO6_PC3_ 1
#define _OCTOSPIM_P1_IO6_PD6_ 1

#define OCTOSPIM_P1_IO7_PC4_ PC4,GPIO_AF10
#define OCTOSPIM_P1_IO7_PD7_ PD7,GPIO_AF10
#define _OCTOSPIM_P1_IO7_PC4_ 1
#define _OCTOSPIM_P1_IO7_PD7_ 1

#define OCTOSPIM_P1_NCS_PA2_ PA2,GPIO_AF10
#define OCTOSPIM_P1_NCS_PA4_ PA4,GPIO_AF3
#define OCTOSPIM_P1_NCS_PB11_ PB11,GPIO_AF10
#define OCTOSPIM_P1_NCS_PC11_ PC11,GPIO_AF5
#define OCTOSPIM_P1_NCS_PE11_ PE11,GPIO_AF10
#define _OCTOSPIM_P1_NCS_PA2_ 1
#define _OCTOSPIM_P1_NCS_PA4_ 1
#define _OCTOSPIM_P1_NCS_PB11_ 1
#define _OCTOSPIM_P1_NCS_PC11_ 1
#define _OCTOSPIM_P1_NCS_PE11_ 1

#define OCTOSPIM_P2_CLK_PF4_ PF4,GPIO_AF5
#define OCTOSPIM_P2_CLK_PH6_ PH6,GPIO_AF5
#define OCTOSPIM_P2_CLK_PI6_ PI6,GPIO_AF5
#define _OCTOSPIM_P2_CLK_PF4_ 1
#define _OCTOSPIM_P2_CLK_PH6_ 1
#define _OCTOSPIM_P2_CLK_PI6_ 1

#define OCTOSPIM_P2_DQS_PF12_ PF12,GPIO_AF5
#define OCTOSPIM_P2_DQS_PG15_ PG15,GPIO_AF5
#define OCTOSPIM_P2_DQS_PG7_ PG7,GPIO_AF5
#define OCTOSPIM_P2_DQS_PH4_ PH4,GPIO_AF5
#define _OCTOSPIM_P2_DQS_PF12_ 1
#define _OCTOSPIM_P2_DQS_PG15_ 1
#define _OCTOSPIM_P2_DQS_PG7_ 1
#define _OCTOSPIM_P2_DQS_PH4_ 1

#define OCTOSPIM_P2_IO0_PF0_ PF0,GPIO_AF5
#define OCTOSPIM_P2_IO0_PI11_ PI11,GPIO_AF5
#define _OCTOSPIM_P2_IO0_PF0_ 1
#define _OCTOSPIM_P2_IO0_PI11_ 1

#define OCTOSPIM_P2_IO1_PF1_ PF1,GPIO_AF5
#define OCTOSPIM_P2_IO1_PI10_ PI10,GPIO_AF5
#define _OCTOSPIM_P2_IO1_PF1_ 1
#define _OCTOSPIM_P2_IO1_PI10_ 1

#define OCTOSPIM_P2_IO2_PF2_ PF2,GPIO_AF5
#define OCTOSPIM_P2_IO2_PI9_ PI9,GPIO_AF5
#define _OCTOSPIM_P2_IO2_PF2_ 1
#define _OCTOSPIM_P2_IO2_PI9_ 1

#define OCTOSPIM_P2_IO3_PF3_ PF3,GPIO_AF5
#define OCTOSPIM_P2_IO3_PH8_ PH8,GPIO_AF5
#define _OCTOSPIM_P2_IO3_PF3_ 1
#define _OCTOSPIM_P2_IO3_PH8_ 1

#define OCTOSPIM_P2_IO4_PG0_ PG0,GPIO_AF5
#define OCTOSPIM_P2_IO4_PH9_ PH9,GPIO_AF5
#define _OCTOSPIM_P2_IO4_PG0_ 1
#define _OCTOSPIM_P2_IO4_PH9_ 1

#define OCTOSPIM_P2_IO5_PG1_ PG1,GPIO_AF5
#define OCTOSPIM_P2_IO5_PH10_ PH10,GPIO_AF5
#define _OCTOSPIM_P2_IO5_PG1_ 1
#define _OCTOSPIM_P2_IO5_PH10_ 1

#define OCTOSPIM_P2_IO6_PG9_ PG9,GPIO_AF5
#define OCTOSPIM_P2_IO6_PH11_ PH11,GPIO_AF5
#define OCTOSPIM_P2_IO6_PH15_ PH15,GPIO_AF5
#define _OCTOSPIM_P2_IO6_PG9_ 1
#define _OCTOSPIM_P2_IO6_PH11_ 1
#define _OCTOSPIM_P2_IO6_PH15_ 1

#define OCTOSPIM_P2_IO7_PG10_ PG10,GPIO_AF5
#define OCTOSPIM_P2_IO7_PH12_ PH12,GPIO_AF5
#define _OCTOSPIM_P2_IO7_PG10_ 1
#define _OCTOSPIM_P2_IO7_PH12_ 1

#define OCTOSPIM_P2_NCS_PD3_ PD3,GPIO_AF10
#define OCTOSPIM_P2_NCS_PG12_ PG12,GPIO_AF5
#define OCTOSPIM_P2_NCS_PI5_ PI5,GPIO_AF5
#define OCTOSPIM_P2_NCS_PI8_ PI8,GPIO_AF5
#define _OCTOSPIM_P2_NCS_PD3_ 1
#define _OCTOSPIM_P2_NCS_PG12_ 1
#define _OCTOSPIM_P2_NCS_PI5_ 1
#define _OCTOSPIM_P2_NCS_PI8_ 1

#define RCC_MCO_PA8_ PA8,GPIO_AF0
#define _RCC_MCO_PA8_ 1

#define RTC_OUT_ALARM_PB2_ PB2,GPIO_AF0
#define _RTC_OUT_ALARM_PB2_ 1

#define RTC_OUT_CALIB_PB2_ PB2,GPIO_AF0
#define _RTC_OUT_CALIB_PB2_ 1

#define RTC_REFIN_PB15_ PB15,GPIO_AF0
#define _RTC_REFIN_PB15_ 1

#define SAI1_CK1_PA3_ PA3,GPIO_AF3
#define SAI1_CK1_PB8_ PB8,GPIO_AF3
#define SAI1_CK1_PE2_ PE2,GPIO_AF3
#define SAI1_CK1_PG7_ PG7,GPIO_AF3
#define _SAI1_CK1_PA3_ 1
#define _SAI1_CK1_PB8_ 1
#define _SAI1_CK1_PE2_ 1
#define _SAI1_CK1_PG7_ 1

#define SAI1_CK2_PA8_ PA8,GPIO_AF3
#define SAI1_CK2_PE5_ PE5,GPIO_AF3
#define _SAI1_CK2_PA8_ 1
#define _SAI1_CK2_PE5_ 1

#define SAI1_D1_PA10_ PA10,GPIO_AF3
#define SAI1_D1_PC3_ PC3,GPIO_AF3
#define SAI1_D1_PD6_ PD6,GPIO_AF3
#define SAI1_D1_PE6_ PE6,GPIO_AF3
#define _SAI1_D1_PA10_ 1
#define _SAI1_D1_PC3_ 1
#define _SAI1_D1_PD6_ 1
#define _SAI1_D1_PE6_ 1

#define SAI1_D2_PB9_ PB9,GPIO_AF3
#define SAI1_D2_PE4_ PE4,GPIO_AF3
#define _SAI1_D2_PB9_ 1
#define _SAI1_D2_PE4_ 1

#define SAI1_D3_PC5_ PC5,GPIO_AF3
#define SAI1_D3_PF10_ PF10,GPIO_AF13
#define _SAI1_D3_PC5_ 1
#define _SAI1_D3_PF10_ 1

#define SAI1_EXTCLK_PA0_ PA0,GPIO_AF13
#define SAI1_EXTCLK_PB0_ PB0,GPIO_AF13
#define _SAI1_EXTCLK_PA0_ 1
#define _SAI1_EXTCLK_PB0_ 1

#define SAI1_FS_A_PA9_ PA9,GPIO_AF13
#define SAI1_FS_A_PB9_ PB9,GPIO_AF13
#define SAI1_FS_A_PE4_ PE4,GPIO_AF13
#define _SAI1_FS_A_PA9_ 1
#define _SAI1_FS_A_PB9_ 1
#define _SAI1_FS_A_PE4_ 1

#define SAI1_FS_B_PA14 (JTCK/SWCLK)_ PA14 (JTCK/SWCLK),GPIO_AF13
#define SAI1_FS_B_PA4_ PA4,GPIO_AF13
#define SAI1_FS_B_PB6_ PB6,GPIO_AF13
#define SAI1_FS_B_PE9_ PE9,GPIO_AF13
#define SAI1_FS_B_PF9_ PF9,GPIO_AF13
#define _SAI1_FS_B_PA14 (JTCK/SWCLK)_ 1
#define _SAI1_FS_B_PA4_ 1
#define _SAI1_FS_B_PB6_ 1
#define _SAI1_FS_B_PE9_ 1
#define _SAI1_FS_B_PF9_ 1

#define SAI1_MCLK_A_PA3_ PA3,GPIO_AF13
#define SAI1_MCLK_A_PB8_ PB8,GPIO_AF13
#define SAI1_MCLK_A_PE2_ PE2,GPIO_AF13
#define SAI1_MCLK_A_PG7_ PG7,GPIO_AF13
#define _SAI1_MCLK_A_PA3_ 1
#define _SAI1_MCLK_A_PB8_ 1
#define _SAI1_MCLK_A_PE2_ 1
#define _SAI1_MCLK_A_PG7_ 1

#define SAI1_MCLK_B_PB4 (NJTRST)_ PB4 (NJTRST),GPIO_AF13
#define SAI1_MCLK_B_PE10_ PE10,GPIO_AF13
#define SAI1_MCLK_B_PF7_ PF7,GPIO_AF13
#define _SAI1_MCLK_B_PB4 (NJTRST)_ 1
#define _SAI1_MCLK_B_PE10_ 1
#define _SAI1_MCLK_B_PF7_ 1

#define SAI1_SCK_A_PA8_ PA8,GPIO_AF13
#define SAI1_SCK_A_PB10_ PB10,GPIO_AF13
#define SAI1_SCK_A_PE5_ PE5,GPIO_AF13
#define _SAI1_SCK_A_PA8_ 1
#define _SAI1_SCK_A_PB10_ 1
#define _SAI1_SCK_A_PE5_ 1

