susanw1/zscript/receivers/generic-c++/zll/arm/implementations/src/main/c++/stm32/AlternateFunction/STM32L4Rx.h
#define SPI3_MISO_PB4 (NJTRST)_ PB4 (NJTRST),GPIO_AF6
#define SPI3_MISO_PC11_ PC11,GPIO_AF6
#define SPI3_MISO_PG10_ PG10,GPIO_AF6
#define _SPI3_MISO_PB4 (NJTRST)_ 1
#define _SPI3_MISO_PC11_ 1
#define _SPI3_MISO_PG10_ 1

#define SPI3_MOSI_PB5_ PB5,GPIO_AF6
#define SPI3_MOSI_PC12_ PC12,GPIO_AF6
#define SPI3_MOSI_PD6_ PD6,GPIO_AF5
#define SPI3_MOSI_PG11_ PG11,GPIO_AF6
#define _SPI3_MOSI_PB5_ 1
#define _SPI3_MOSI_PC12_ 1
#define _SPI3_MOSI_PD6_ 1
#define _SPI3_MOSI_PG11_ 1

#define SPI3_NSS_PA15 (JTDI)_ PA15 (JTDI),GPIO_AF6
#define SPI3_NSS_PA4_ PA4,GPIO_AF6
#define SPI3_NSS_PG12_ PG12,GPIO_AF6
#define _SPI3_NSS_PA15 (JTDI)_ 1
#define _SPI3_NSS_PA4_ 1
#define _SPI3_NSS_PG12_ 1

#define SPI3_SCK_PB3 (JTDO/TRACESWO)_ PB3 (JTDO/TRACESWO),GPIO_AF6
#define SPI3_SCK_PC10_ PC10,GPIO_AF6
#define SPI3_SCK_PG9_ PG9,GPIO_AF6
#define _SPI3_SCK_PB3 (JTDO/TRACESWO)_ 1
#define _SPI3_SCK_PC10_ 1
#define _SPI3_SCK_PG9_ 1

#define SYS_JTCK_SWCLK_PA14 (JTCK/SWCLK)_ PA14 (JTCK/SWCLK),GPIO_AF0
#define _SYS_JTCK_SWCLK_PA14 (JTCK/SWCLK)_ 1

#define SYS_JTDI_PA15 (JTDI)_ PA15 (JTDI),GPIO_AF0
#define _SYS_JTDI_PA15 (JTDI)_ 1

#define SYS_JTDO_SWO_PB3 (JTDO/TRACESWO)_ PB3 (JTDO/TRACESWO),GPIO_AF0
#define _SYS_JTDO_SWO_PB3 (JTDO/TRACESWO)_ 1

#define SYS_JTMS_SWDIO_PA13 (JTMS/SWDIO)_ PA13 (JTMS/SWDIO),GPIO_AF0
#define _SYS_JTMS_SWDIO_PA13 (JTMS/SWDIO)_ 1

#define SYS_JTRST_PB4 (NJTRST)_ PB4 (NJTRST),GPIO_AF0
#define _SYS_JTRST_PB4 (NJTRST)_ 1

#define SYS_TRACECLK_PE2_ PE2,GPIO_AF0
#define _SYS_TRACECLK_PE2_ 1

#define SYS_TRACED0_PC1_ PC1,GPIO_AF0
#define SYS_TRACED0_PC9_ PC9,GPIO_AF0
#define SYS_TRACED0_PE3_ PE3,GPIO_AF0
#define _SYS_TRACED0_PC1_ 1
#define _SYS_TRACED0_PC9_ 1
#define _SYS_TRACED0_PE3_ 1

#define SYS_TRACED1_PC10_ PC10,GPIO_AF0
#define SYS_TRACED1_PE4_ PE4,GPIO_AF0
#define _SYS_TRACED1_PC10_ 1
#define _SYS_TRACED1_PE4_ 1

#define SYS_TRACED2_PD2_ PD2,GPIO_AF0
#define SYS_TRACED2_PE5_ PE5,GPIO_AF0
#define _SYS_TRACED2_PD2_ 1
#define _SYS_TRACED2_PE5_ 1

#define SYS_TRACED3_PC12_ PC12,GPIO_AF0
#define SYS_TRACED3_PE6_ PE6,GPIO_AF0
#define _SYS_TRACED3_PC12_ 1
#define _SYS_TRACED3_PE6_ 1

#define TIM15_BKIN_PA9_ PA9,GPIO_AF14
#define TIM15_BKIN_PB12_ PB12,GPIO_AF14
#define _TIM15_BKIN_PA9_ 1
#define _TIM15_BKIN_PB12_ 1

#define TIM15_CH1_PA2_ PA2,GPIO_AF14
#define TIM15_CH1_PB14_ PB14,GPIO_AF14
#define TIM15_CH1_PF9_ PF9,GPIO_AF14
#define TIM15_CH1_PG10_ PG10,GPIO_AF14
#define _TIM15_CH1_PA2_ 1
#define _TIM15_CH1_PB14_ 1
#define _TIM15_CH1_PF9_ 1
#define _TIM15_CH1_PG10_ 1

#define TIM15_CH1N_PA1_ PA1,GPIO_AF14
#define TIM15_CH1N_PB13_ PB13,GPIO_AF14
#define TIM15_CH1N_PG9_ PG9,GPIO_AF14
#define _TIM15_CH1N_PA1_ 1
#define _TIM15_CH1N_PB13_ 1
#define _TIM15_CH1N_PG9_ 1

#define TIM15_CH2_PA3_ PA3,GPIO_AF14
#define TIM15_CH2_PB15_ PB15,GPIO_AF14
#define TIM15_CH2_PF10_ PF10,GPIO_AF14
#define TIM15_CH2_PG11_ PG11,GPIO_AF14
#define _TIM15_CH2_PA3_ 1
#define _TIM15_CH2_PB15_ 1
#define _TIM15_CH2_PF10_ 1
#define _TIM15_CH2_PG11_ 1

#define TIM16_BKIN_PB5_ PB5,GPIO_AF14
#define _TIM16_BKIN_PB5_ 1

#define TIM16_CH1_PA6_ PA6,GPIO_AF14
#define TIM16_CH1_PB8_ PB8,GPIO_AF14
#define TIM16_CH1_PE0_ PE0,GPIO_AF14
#define _TIM16_CH1_PA6_ 1
#define _TIM16_CH1_PB8_ 1
#define _TIM16_CH1_PE0_ 1

#define TIM16_CH1N_PB6_ PB6,GPIO_AF14
#define _TIM16_CH1N_PB6_ 1

#define TIM17_BKIN_PA10_ PA10,GPIO_AF14
#define TIM17_BKIN_PB4 (NJTRST)_ PB4 (NJTRST),GPIO_AF14
#define _TIM17_BKIN_PA10_ 1
#define _TIM17_BKIN_PB4 (NJTRST)_ 1

#define TIM17_CH1_PA7_ PA7,GPIO_AF14
#define TIM17_CH1_PB9_ PB9,GPIO_AF14
#define TIM17_CH1_PE1_ PE1,GPIO_AF14
#define _TIM17_CH1_PA7_ 1
#define _TIM17_CH1_PB9_ 1
#define _TIM17_CH1_PE1_ 1

#define TIM17_CH1N_PB7_ PB7,GPIO_AF14
#define _TIM17_CH1N_PB7_ 1

#define TIM1_BKIN_PA6_ PA6,GPIO_AF12
#define TIM1_BKIN_PB12_ PB12,GPIO_AF3
#define TIM1_BKIN_PE15_ PE15,GPIO_AF3
#define _TIM1_BKIN_PA6_ 1
#define _TIM1_BKIN_PB12_ 1
#define _TIM1_BKIN_PE15_ 1

#define TIM1_BKIN2_PA11_ PA11,GPIO_AF12
#define TIM1_BKIN2_PE14_ PE14,GPIO_AF3
#define _TIM1_BKIN2_PA11_ 1
#define _TIM1_BKIN2_PE14_ 1

#define TIM1_CH1_PA8_ PA8,GPIO_AF1
#define TIM1_CH1_PE9_ PE9,GPIO_AF1
#define _TIM1_CH1_PA8_ 1
#define _TIM1_CH1_PE9_ 1

#define TIM1_CH1N_PA7_ PA7,GPIO_AF1
#define TIM1_CH1N_PB13_ PB13,GPIO_AF1
#define TIM1_CH1N_PE8_ PE8,GPIO_AF1
#define _TIM1_CH1N_PA7_ 1
#define _TIM1_CH1N_PB13_ 1
#define _TIM1_CH1N_PE8_ 1

#define TIM1_CH2_PA9_ PA9,GPIO_AF1
#define TIM1_CH2_PE11_ PE11,GPIO_AF1
#define _TIM1_CH2_PA9_ 1
#define _TIM1_CH2_PE11_ 1

#define TIM1_CH2N_PB0_ PB0,GPIO_AF1
#define TIM1_CH2N_PB14_ PB14,GPIO_AF1
#define TIM1_CH2N_PE10_ PE10,GPIO_AF1
#define _TIM1_CH2N_PB0_ 1
#define _TIM1_CH2N_PB14_ 1
#define _TIM1_CH2N_PE10_ 1

#define TIM1_CH3_PA10_ PA10,GPIO_AF1
#define TIM1_CH3_PE13_ PE13,GPIO_AF1
#define _TIM1_CH3_PA10_ 1
#define _TIM1_CH3_PE13_ 1

#define TIM1_CH3N_PB1_ PB1,GPIO_AF1
#define TIM1_CH3N_PB15_ PB15,GPIO_AF1
#define TIM1_CH3N_PE12_ PE12,GPIO_AF1
#define _TIM1_CH3N_PB1_ 1
#define _TIM1_CH3N_PB15_ 1
#define _TIM1_CH3N_PE12_ 1

#define TIM1_CH4_PA11_ PA11,GPIO_AF1
#define TIM1_CH4_PE14_ PE14,GPIO_AF1
#define _TIM1_CH4_PA11_ 1
#define _TIM1_CH4_PE14_ 1

#define TIM1_ETR_PA12_ PA12,GPIO_AF1
#define TIM1_ETR_PE7_ PE7,GPIO_AF1
#define _TIM1_ETR_PA12_ 1
#define _TIM1_ETR_PE7_ 1

#define TIM2_CH1_PA0_ PA0,GPIO_AF1
#define TIM2_CH1_PA15 (JTDI)_ PA15 (JTDI),GPIO_AF1
#define TIM2_CH1_PA5_ PA5,GPIO_AF1
#define _TIM2_CH1_PA0_ 1
#define _TIM2_CH1_PA15 (JTDI)_ 1
#define _TIM2_CH1_PA5_ 1

#define TIM2_CH2_PA1_ PA1,GPIO_AF1
#define TIM2_CH2_PB3 (JTDO/TRACESWO)_ PB3 (JTDO/TRACESWO),GPIO_AF1
#define _TIM2_CH2_PA1_ 1
#define _TIM2_CH2_PB3 (JTDO/TRACESWO)_ 1

#define TIM2_CH3_PA2_ PA2,GPIO_AF1
#define TIM2_CH3_PB10_ PB10,GPIO_AF1
#define _TIM2_CH3_PA2_ 1
#define _TIM2_CH3_PB10_ 1

#define TIM2_CH4_PA3_ PA3,GPIO_AF1
#define TIM2_CH4_PB11_ PB11,GPIO_AF1
#define _TIM2_CH4_PA3_ 1
#define _TIM2_CH4_PB11_ 1

#define TIM2_ETR_PA0_ PA0,GPIO_AF14
#define TIM2_ETR_PA15 (JTDI)_ PA15 (JTDI),GPIO_AF2
#define TIM2_ETR_PA5_ PA5,GPIO_AF2
#define _TIM2_ETR_PA0_ 1
#define _TIM2_ETR_PA15 (JTDI)_ 1
#define _TIM2_ETR_PA5_ 1

